# School District Analysis

In [2]:
# Dependencies
import pandas as pd

In [3]:
# Files
school_csv = "Resources/schools_complete.csv"
student_csv = "Resources/students_complete.csv"

In [4]:
sch_data = pd.read_csv(school_csv)
stu_data = pd.read_csv(student_csv)

In [5]:
#Checked data / looked up for NA's 
sch_data.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [6]:
sch_data.count()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [8]:
stu_data.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [9]:
stu_data.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [10]:
# Combine the data into a single dataset.  
sch_stu_data = pd.merge(stu_data, sch_data, how="left", on=["school_name", "school_name"])

In [11]:
sch_stu_data.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

# District Summary

In [12]:
# Total schools
total_schools = sch_stu_data["School ID"].nunique()
total_schools

15

In [13]:
# Total students
total_students = sch_stu_data["Student ID"].nunique()
total_students

39170

In [ ]:
# Total budget

In [ ]:
# Average math score

In [ ]:
# Average reading score

In [ ]:
# % passing math (the percentage of students who passed math)

In [ ]:
# % passing reading (the percentage of students who passed reading)

In [ ]:
# % overall passing (the percentage of students who passed math AND reading)

In [ ]:
# Dataframe with the above results  #  round() results

# School Summary